---
kind: other
id: Methods.T:Autodesk.Revit.DB.BoundarySegment
source: html/109fddb7-82a5-31b7-9334-54a876fab07b.htm
---
# BoundarySegment Methods

Get a copy of the curve that is formed along this boundary.